#include "TextTraining.h"
#include <iostream>
#include <iomanip>
#include <stdio.h>
#include <chrono>
#include <conio.h>
#include "ConsoleInterface.h"
#include <string>
#include <list>
#include <set>

using namespace std;
using namespace chrono;

/*
	Функція виводу меню в консоль
*/
const string SENTENCES[25] = { "Як умру, то поховайте Мене на могилі Серед степу широкого На Вкраїні милій, Щоб лани широкополі, І Дніпро, і кручі Було видно, було чути, Як реве ревучий.",
									"Ти одна заложила єму серцю позов на вічнії роки, і душа моя єжечасно волаєть тебе і послі нишпорной даже години.",
									"Боже ж мій, Боже! скільки я літ працювала, скільки нічок недоспала, думок передумала, здоров'я вкоротила, поки сього добра наскладала!",
									"Сорок літ я трудився, навчав, Весь заглиблений в тобі, Щоб з рабів тих зробили народ По твоїй уподобі.",
									"Якщо немає націоналізму, немає нації, я так до цього ставлюся. Націоналізм має бути не агресивний, він повинен бути дипломатичний, інтелігентний.",
									"Коли поміж хлібом і свободою народ обирає хліб, він зрештою втрачає все, в тому числі і хліб. Якщо народ обирає свободу, він матиме хліб, вирощений ним самим і ніким не відібраний.",
									"Не жаль мені, що я тебе кохаю, Та в нас дороги різно розійшлись. Ні, не кажи, що зійдуться колись! Не зійдуться, мій друже, я те знаю.",
									"Малоросійство – це не політика і навіть не тактика, лише завжди апріорна і тотальна капітуляція.",
									"Україна в ЄС — це смерть російського імперського проєкту. До того ж це потужний удар по російському авторитаризму, шлях до демократичних змін в Росії та на всьому пострадянському просторі.",
									"Мене це хвилює. Дивіться, ми підтримуємо територіальну цілісність України, ми підтримуємо їхню здатність управляти своєю державою.",
									"Думи мої, думи мої, Лихо мені з вами! Нащо стали на папері Сумними рядами?",
									"Я бачив дивний сон. Немов передо мною Безмiрна, та пуста, i дика площина I я, прикований ланцем залiзним, стою Пiд височенною гранiтною скалою, А далi тисячi таких самих, як я.",
									"Гетьте, думи, ви, хмари осінні! То ж тепера весна золота! Чи то так у жалю, в голосінні Проминуть молодії літа?",
									"Якщо прийде журба, то не думай її Рознести у веселощах бучних За столом, де веселії друзі твої П’ють-гуляють при покликах гучних.",
									"Як-таки за таким і таким ділом ходити, як-таки так і так думати! Чи се ж гоже? Як-таки такому чоловікові се і те збиратися робити?",
									"Iще ж i се ми думаємо, що як постигне кого-небудь бiда i нещастя, що похова кого iз своєї сiм'ї або i родичiв, то буцiмто сеє чоловiковi приходить за його грiхи й неправди прежнiї. Нi, не так сеє!",
									"А коли треба, то й поперечний! Трандалєв. Поперечних не полагається. Ви заспокойтесь, уголовна палата одмінить рішеніє - ми виграємо діло.",
									"Не знає свого щастя; сказано: молоде - дурне… Ох, діти-діти! Якби ви знали, як-то хочеться бачить вас хорошими людьми, щоб ви не черствий хліб їли.",
									"Я завжди мріяв написати пісню про маму, але різні поети всі слова вже сказали. І я не хотів повторити когось із них.",
									"Цей сон, цей сон Мені щоночі сниться Крізь сон, крізь сон Вона мені сміється Цей сон, цей сон Мене не покидає Любов, о сон Вона мене кохає.",
									"Ох, не хотів би буть я на вашому місці Хоч і на своєму страшно, тут в когось порожньо в мисці Не чекали вас ніде тут: ні в селі, ні в місті Орки, ваші руки брудні, навіть коли руки чисті.",
									"Ти так давно всі двері зачинила, Що думав я промокну під дощем, А ти така солодка, моя мила, У мене в серці знов приємний щем!",
									"А ми з москалями та й не в згоді жили, На самого Петра у бій ми вступили Москалі тікали, аж лапті губили, А наші за ними постріли били.",
									"Все те, що буде зроблене проти, на твою ж таки голову і впаде. За здобутком завжди втрата простує.",
									"Краси перемагати не повинна. Не гідна ти дочкою лісу зватись! бо в тебе дух не вільний лісовий, а хатній рабський!" };

void TextTraining::printMenu() {
	cout << "--------------------------------------------------------------------------" << endl;
	cout << "| Наступне тренування включає тренування на введення тексту. Після поча- |" << endl;
	cout << "| тку на кожне речення буде відведений певний час, який зменшується при  |" << endl;
	cout << "| при кожному наступному введені.                                        |" << endl;
	cout << "|                                                                        |" << endl;
	cout << "| УВАГА! В цьому режимі після введення кожної комбінації не потрібно     |" << endl;
	cout << "| натискати для підтвердження вводу речення. Також в даному режимі виво- |" << endl;
	cout << "| диться текст набраного речення.                                        |" << endl;
	cout << "|                                                                        |" << endl;
	cout << "| Виберіть опцію меню:                                                   |" << endl;
	cout << "| (1) Вийти з тренування                                                 |" << endl;
	cout << "| (2) Почати тренування з простими реченням                              |" << endl;
	cout << "| (3) Вибрати текст для тренування                                       |" << endl;
	cout << "| (4) Завершити виконаня                                                 |" << endl;
	cout << "--------------------------------------------------------------------------" << endl;
}

/*
	Функція початку роботи з меню тренування
*/
void TextTraining::openTraining() {
	system("CLS"); // очистити консоль
	while (true) {
		printMenu(); // вивести меню-підказку
		int input = ConsoleInterface::getIntInput(0, 2);
		switch (input) {
		case 1: // повернутися до попереднього меню
			system("CLS");
			return;
		case 2: // почати тренування з простими реченням
			startTraining();
			break;
		case 3: // // почати тренування з творами
			startTrainingWithTexts();
			break;
		case 4: // завершити роботу програми
			exit(0);
		}
	}
}
void TextTraining::startTraining() {
	int inputs = 0; // кількість введних речень
	int sentence_count = 15; // кількість речень
	int matched_chars = 0; // кількість правильно введених речень
	int total_chars = 0; // загальна кількість символів
	char input_char; // введений символ
	int used_sentences[25];
	string input; // введена комбінація 
	string generated; // згенероване речення
	long long time_to_enter = 15000; // початковий час на введення 15 секунд
	long long spent_time; // витрачений час на введення речення
	long long total_enter_time = 0; // загальний час вводу всіх речень
	bool previous_match = false; // для перевірки чи попередній ввід був правильний
	bool on_time = false; // для перевірки чи попередній ввід був вчасний
	do {
		system("CLS"); // очистити консоль

		high_resolution_clock::time_point before = high_resolution_clock::now(); // запам'ятати час до введення
		generated = getRandText(used_sentences); // отримати текст
		if (inputs != 0) { // якщо не перший ввід
			if (on_time) { // якщо вчасно
				if (previous_match) { // якщо правильний ввід
					cout << "Попереднє введення: ПРАВИЛЬНО" << endl;
				}
				else { // вчасно, неправильний ввід
					cout << "Попереднє введення: НЕПРАВИЛЬНО, введено '" << input << "', очікувалося '" << generated << "'" << endl;
				}
			}
			else { // якщо невчасно
				cout << "Попереднє речення було введено невчасно" << endl;
			}
		}
		else { // якщо перший ввід 
			cout << endl;
		}
		input = "\0"; // для занулення попереднього введеного тексту
		cout << "Введіть речення: '" << generated << "'" << endl; // вивести підказку та комбінацію
		for (size_t i = 0; i < generated.length(); ++i) { // введення комбінації
			input_char = _getch(); // отримати наступний символ з консолі
			input += input_char; // додати до поточного введеня комбінації введений символ
			cout << input_char; // вивести введений символ
		}
		++inputs; // збільшити кількість введень
		high_resolution_clock::time_point after = high_resolution_clock::now(); // запам'ятати час після введення

		spent_time = floor<milliseconds>(after - before).count(); // порахувати час введення
		total_enter_time += spent_time; // збільшити загальний час введення

		if (time_to_enter > spent_time) { // якщо вчасно введено
			on_time = true; // встановити прапорець чи вчасний ввід true
			previous_match = true; // встановити прапорець чи правильний ввід true
			for (int i = 0; i < generated.length(); ++i) { // перевірити співпадіння кожного символу
				if (input[i] == generated[i]) { // якщо символи однакові
					++matched_chars; // збільшити лічильник правильно введених букв на 1
				}
				else { // якщо символи різні
					previous_match = false; // встановити прапорець чи правильний ввід false
				}
			}
		}
		else { // встановити прапорець чи вчасний ввід false
			on_time = false;
		}
		total_chars += generated.length();
		time_to_enter *= 0.93; // зменшити час на введення на 7%
	} while (inputs < sentence_count); // робити до тих пір, поки кількість введень не досягне 15

	Training::printResults(matched_chars, total_chars, total_enter_time); // вивести результати

}

void TextTraining::startTrainingWithTexts() {

}

/*
	Функція виведення результатів
*/
//void CombinationTraining::printResults(int matched_chars, int total_chars, long long total_enter_time) {
//	system("CLS"); // очистити консоль
//	// вивести точність за формулою (правильне введення) / 25 * 100%
//	// вивести рівень за критеріями кількості правильних введень: 
//	//         [0,4] - новачок, 	
//	//         [5,14] - продвинутий, 
//	//         [15,20] - Механічні пальці, 
//	//         [21,25] - Штучний інтелект
//	cout << "--------------------------------------------------------------------------" << endl;
//	cout << "| Результати:                                                            |" << endl;
//	cout << "|                                                                        |" << endl;
//	cout << "| Точність: " << setw(5) << setprecision(5) << 100.0 * matched_chars / total_chars << "%" << setw(56) << "|" << endl;
//	cout << "| Рівень: ";
//	if (matched_chars < 5) {
//		cout << setw(10) << "Новачок :(";
//	}
//	else if (matched_chars < 15) {
//		cout << setw(10) << "Продвинутий -_-";
//	}
//	else if (matched_chars < 20) {
//		cout << setw(10) << "Механічні пальці :)";
//	}
//	else {
//		cout << setw(10) << "Штучний інтелект О_О";
//	}
//	cout << "                                                     |" << endl;
//	cout << "| Середній час введення букви (мілісекунд): " << setw(15) << setprecision(5) << left << total_enter_time / total_chars << setw(15) << "|" << endl;
//	cout << "--------------------------------------------------------------------------" << endl;
//}

string TextTraining::getRandText(int used_sentences[]) {
	list<int> list = { 10, 20, 30, 40, 50 };
	list.
}
